//
//  main.cpp
//  Arithmetic_operations
//
//  Created by Данила Ушаков on 24.09.2023.
//

#include <iostream>
#include <locale.h>
#include <math.h>
using namespace std;
int main()
{
    setlocale(LC_ALL, "Rus");
    
    /*Создайте программу, которая переводит метры в киллометры.
     Например, пользователь вводит 2345 метров, а программа в ответ отображает 2 километра и 345 метров.*/
    /*int meters{};
    cout << "Введите количество метров: ";
    cin >> meters;
    cout << meters / 1000 << " километра и " << meters % 1000 << " метров." << endl;*/
    
    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    /*Напишите программу, которая запрашивает у пользователь радиус круга и, используя полученный радиус, вычисляет площадь круга.*/
    /*const float P{3.14};
    float radius{};
    
    cout << "Введите радиус круга: ";
    cin >> radius;
    cout << "Площадь круга = " << P * pow(radius, 2) << endl;*/
    
    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    /*Напишите программу обмена валют: программа запрашивает текущий курс доллара, например, к рублю, и количество единиц (рублей) для конвертации и выводит на консоль сконвертированную сумму в долларах.*/
    /*float course{};
    float sum{};
    cout << "Введите текущий курс доллара: ";
    cin >> course;
    cout << "Введите сумму в рублях: ";
    cin >> sum;
    cout << "Сконвертированная сумма в долларах = " << sum / course << endl;*/
    
    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    /*Индекс массы тела (ИМТ) представляет массу человека в килограммах, деленную на квадрат роста в метрах (масса/(рост * рост)).
     Напишите программу, которая спрашивает у пользователя его вес (в киллограммах) и рост (сантиметрах), по ним вычисляет индекс массы тела и выводит его на консоль.*/
    float weight{};
    float height{};
    cout << "Введите ваш вес (в килограммах): ";
    cin >> weight;
    cout << "Введите ваш рост (в сантиметрах): ";
    cin >> height;
    cout << "Индекс массы тела = " << weight / pow(height, 2) << endl;
}
